CyberGrandChallenge/binutils/bfd/cgc32-rl78.c
	  /* An external symbol.  */
	  indx = CGC32_R_SYM (rel->r_info) - symtab_hdr->sh_info;
	  h = cgc_sym_hashes (abfd)[indx];
	  BFD_ASSERT (h != NULL);

	  if (h->root.type != bfd_link_hash_defined
	      && h->root.type != bfd_link_hash_defweak)
	    {
	      /* This appears to be a reference to an undefined
		 symbol.  Just ignore it--it will be caught by the
		 regular reloc processing.  */
	      if (lrel)
		*lrel = rel;
	      return 0;
	    }

	  symval = (h->root.u.def.value
		    + h->root.u.def.section->output_section->vma
		    + h->root.u.def.section->output_offset);

	  symval += rel->r_addend;
	}

      switch (CGC32_R_TYPE (rel->r_info))
	{
	case R_RL78_SYM:
	  RL78_STACK_PUSH (symval);
	  break;

	case R_RL78_OPneg:
	  RL78_STACK_POP (tmp1);
	  tmp1 = - tmp1;
	  RL78_STACK_PUSH (tmp1);
	  break;

	case R_RL78_OPadd:
	  RL78_STACK_POP (tmp1);
	  RL78_STACK_POP (tmp2);
	  tmp1 += tmp2;
	  RL78_STACK_PUSH (tmp1);
	  break;

	case R_RL78_OPsub:
	  RL78_STACK_POP (tmp1);
	  RL78_STACK_POP (tmp2);
	  tmp2 -= tmp1;
	  RL78_STACK_PUSH (tmp2);
	  break;

	case R_RL78_OPmul:
	  RL78_STACK_POP (tmp1);
	  RL78_STACK_POP (tmp2);
	  tmp1 *= tmp2;
	  RL78_STACK_PUSH (tmp1);
	  break;

	case R_RL78_OPdiv:
	  RL78_STACK_POP (tmp1);
	  RL78_STACK_POP (tmp2);
	  tmp1 /= tmp2;
	  RL78_STACK_PUSH (tmp1);
	  break;

	case R_RL78_OPshla:
	  RL78_STACK_POP (tmp1);
	  RL78_STACK_POP (tmp2);
	  tmp1 <<= tmp2;
	  RL78_STACK_PUSH (tmp1);
	  break;

	case R_RL78_OPshra:
	  RL78_STACK_POP (tmp1);
	  RL78_STACK_POP (tmp2);
	  tmp1 >>= tmp2;
	  RL78_STACK_PUSH (tmp1);
	  break;

	case R_RL78_OPsctsize:
	  RL78_STACK_PUSH (input_section->size);
	  break;

	case R_RL78_OPscttop:
	  RL78_STACK_PUSH (input_section->output_section->vma);
	  break;

	case R_RL78_OPand:
	  RL78_STACK_POP (tmp1);
	  RL78_STACK_POP (tmp2);
	  tmp1 &= tmp2;
	  RL78_STACK_PUSH (tmp1);
	  break;

	case R_RL78_OPor:
	  RL78_STACK_POP (tmp1);
	  RL78_STACK_POP (tmp2);
	  tmp1 |= tmp2;
	  RL78_STACK_PUSH (tmp1);
	  break;

	case R_RL78_OPxor:
	  RL78_STACK_POP (tmp1);
	  RL78_STACK_POP (tmp2);
	  tmp1 ^= tmp2;
	  RL78_STACK_PUSH (tmp1);
	  break;

	case R_RL78_OPnot:
	  RL78_STACK_POP (tmp1);
	  tmp1 = ~ tmp1;
	  RL78_STACK_PUSH (tmp1);
	  break;

	case R_RL78_OPmod:
	  RL78_STACK_POP (tmp1);
	  RL78_STACK_POP (tmp2);
	  tmp1 %= tmp2;
	  RL78_STACK_PUSH (tmp1);
	  break;

	case R_RL78_OPromtop:
	  RL78_STACK_PUSH (get_romstart (&r, info, input_bfd, input_section, rel->r_offset));
	  break;

	case R_RL78_OPramtop:
	  RL78_STACK_PUSH (get_ramstart (&r, info, input_bfd, input_section, rel->r_offset));
	  break;

	case R_RL78_DIR16UL:
	case R_RL78_DIR8UL:
	case R_RL78_ABS16UL:
	case R_RL78_ABS8UL:
	  if (rl78_stack_top)
	    RL78_STACK_POP (symval);
	  if (lrel)
	    *lrel = rel;
	  *scale = 4;
	  return symval;

	case R_RL78_DIR16UW:
	case R_RL78_DIR8UW:
	case R_RL78_ABS16UW:
	case R_RL78_ABS8UW:
	  if (rl78_stack_top)
	    RL78_STACK_POP (symval);
	  if (lrel)
	    *lrel = rel;
	  *scale = 2;
	  return symval;

	default:
	  if (rl78_stack_top)
	    RL78_STACK_POP (symval);
	  if (lrel)
	    *lrel = rel;
	  return symval;
	}

      rel ++;
    }
}

struct {
  int prefix;		/* or -1 for "no prefix" */
  int insn;		/* or -1 for "end of list" */
  int insn_for_saddr;	/* or -1 for "no alternative" */
  int insn_for_sfr;	/* or -1 for "no alternative" */
} relax_addr16[] = {
  { -1, 0x02, 0x06, -1 },	/* ADDW	AX, !addr16 */
  { -1, 0x22, 0x26, -1 },	/* SUBW	AX, !addr16 */
  { -1, 0x42, 0x46, -1 },	/* CMPW	AX, !addr16 */
  { -1, 0x40, 0x4a, -1 },	/* CMP	!addr16, #byte */

  { -1, 0x0f, 0x0b, -1 },	/* ADD	A, !addr16 */
  { -1, 0x1f, 0x1b, -1 },	/* ADDC	A, !addr16 */
  { -1, 0x2f, 0x2b, -1 },	/* SUB	A, !addr16 */
  { -1, 0x3f, 0x3b, -1 },	/* SUBC	A, !addr16 */
  { -1, 0x4f, 0x4b, -1 },	/* CMP	A, !addr16 */
  { -1, 0x5f, 0x5b, -1 },	/* AND	A, !addr16 */
  { -1, 0x6f, 0x6b, -1 },	/* OR	A, !addr16 */
  { -1, 0x7f, 0x7b, -1 },	/* XOR	A, !addr16 */

  { -1, 0x8f, 0x8d, 0x8e },	/* MOV	A, !addr16 */
  { -1, 0x9f, 0x9d, 0x9e },	/* MOV	!addr16, A */
  { -1, 0xaf, 0xad, 0xae },	/* MOVW	AX, !addr16 */
  { -1, 0xbf, 0xbd, 0xbe },	/* MOVW	!addr16, AX */
  { -1, 0xcf, 0xcd, 0xce },	/* MOVW	!addr16, #word */

  { -1, 0xa0, 0xa4, -1 },	/* INC	!addr16 */
  { -1, 0xa2, 0xa6, -1 },	/* INCW	!addr16 */
  { -1, 0xb0, 0xb4, -1 },	/* DEC	!addr16 */
  { -1, 0xb2, 0xb6, -1 },	/* DECW	!addr16 */

  { -1, 0xd5, 0xd4, -1 },	/* CMP0	!addr16 */
  { -1, 0xe5, 0xe4, -1 },	/* ONEB	!addr16 */
  { -1, 0xf5, 0xf4, -1 },	/* CLRB	!addr16 */

  { -1, 0xd9, 0xd8, -1 },	/* MOV	X, !addr16 */
  { -1, 0xe9, 0xe8, -1 },	/* MOV	B, !addr16 */
  { -1, 0xf9, 0xf8, -1 },	/* MOV	C, !addr16 */
  { -1, 0xdb, 0xda, -1 },	/* MOVW	BC, !addr16 */
  { -1, 0xeb, 0xea, -1 },	/* MOVW	DE, !addr16 */
  { -1, 0xfb, 0xfa, -1 },	/* MOVW	HL, !addr16 */

  { 0x61, 0xaa, 0xa8, -1 },	/* XCH	A, !addr16 */

  { 0x71, 0x00, 0x02, 0x0a },	/* SET1	!addr16.0 */
  { 0x71, 0x10, 0x12, 0x1a },	/* SET1	!addr16.0 */
  { 0x71, 0x20, 0x22, 0x2a },	/* SET1	!addr16.0 */
  { 0x71, 0x30, 0x32, 0x3a },	/* SET1	!addr16.0 */
  { 0x71, 0x40, 0x42, 0x4a },	/* SET1	!addr16.0 */
  { 0x71, 0x50, 0x52, 0x5a },	/* SET1	!addr16.0 */
  { 0x71, 0x60, 0x62, 0x6a },	/* SET1	!addr16.0 */
  { 0x71, 0x70, 0x72, 0x7a },	/* SET1	!addr16.0 */

  { 0x71, 0x08, 0x03, 0x0b },	/* CLR1	!addr16.0 */
  { 0x71, 0x18, 0x13, 0x1b },	/* CLR1	!addr16.0 */
  { 0x71, 0x28, 0x23, 0x2b },	/* CLR1	!addr16.0 */
  { 0x71, 0x38, 0x33, 0x3b },	/* CLR1	!addr16.0 */
  { 0x71, 0x48, 0x43, 0x4b },	/* CLR1	!addr16.0 */
  { 0x71, 0x58, 0x53, 0x5b },	/* CLR1	!addr16.0 */
  { 0x71, 0x68, 0x63, 0x6b },	/* CLR1	!addr16.0 */
  { 0x71, 0x78, 0x73, 0x7b },	/* CLR1	!addr16.0 */

  { -1, -1, -1, -1 }
};

/* Relax one section.  */

static bfd_boolean
rl78_cgc_relax_section
    (bfd *                  abfd,
     asection *             sec,
     struct bfd_link_info * link_info,
     bfd_boolean *          again)
{
  Cgc_Internal_Shdr * symtab_hdr;
  Cgc_Internal_Shdr * shndx_hdr;
  Cgc_Internal_Rela * internal_relocs;
  Cgc_Internal_Rela * free_relocs = NULL;
  Cgc_Internal_Rela * irel;
  Cgc_Internal_Rela * srel;
  Cgc_Internal_Rela * irelend;
  Cgc_Internal_Rela * next_alignment;
  bfd_byte *          contents = NULL;
  bfd_byte *          free_contents = NULL;
  Cgc_Internal_Sym *  intsyms = NULL;
  Cgc_Internal_Sym *  free_intsyms = NULL;
  Cgc_External_Sym_Shndx * shndx_buf = NULL;
  bfd_vma pc;
  bfd_vma symval ATTRIBUTE_UNUSED = 0;
  int pcrel ATTRIBUTE_UNUSED = 0;
  int code ATTRIBUTE_UNUSED = 0;
  int section_alignment_glue;
  int scale;

  if (abfd == cgc_hash_table (link_info)->dynobj
      && strcmp (sec->name, ".plt") == 0)
    return rl78_cgc_relax_plt_section (abfd, sec, link_info, again);

  /* Assume nothing changes.  */
  *again = FALSE;

  /* We don't have to do anything for a relocatable link, if
     this section does not have relocs, or if this is not a
     code section.  */
  if (link_info->relocatable
      || (sec->flags & SEC_RELOC) == 0
      || sec->reloc_count == 0
      || (sec->flags & SEC_CODE) == 0)
    return TRUE;

  symtab_hdr = &cgc_tdata (abfd)->symtab_hdr;
  shndx_hdr = &cgc_tdata (abfd)->symtab_shndx_hdr;

